#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	ЕАС_ОбластиДанныхКопируемый.НазначитьОбластьДанных(ЭтотОбъект);
	
	ЕАС_ОбменВызовСервераКопируемый.ЗарегистрироватьИзмененияДокумента(ЭтотОбъект);
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
	ЕАС_ОбменВызовСервераКопируемый.ЗарегистрироватьИзмененияДокумента(ЭтотОбъект);
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли