#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Параметры.ПолеФормы) Тогда
		ПолеФормы = Параметры.ПолеФормы;
		ЗаполнитьЗначенияСвойств(ЭтаФорма, ПолеФормы, "ДатаНачала,ДатаОкончания");
		Период.ДатаНачала    = ДатаНачала;
		Период.ДатаОкончания = ДатаОкончания;
		Для Каждого РасшифровкаСтроки Из Параметры.Расшифровка Цикл
			ЗаполнитьЗначенияСвойств(ЗначенияПоказателей.Добавить(), РасшифровкаСтроки.Значение);
		КонецЦикла;	
	Иначе	
		ТекстСообщения = НСтр("ru = 'Открытие формы без параметров не предусмотрено'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Отказ = Истина;
	КонецЕсли;	
	Элементы.ЗначенияПоказателейЗначение.Формат = "ЧДЦ=" + ПолеФормы.ТочностьЧисла;
	Элементы.ЗначенияПоказателейЗначение.ТекстПодвала = Формат(ЗначенияПоказателей.Итог("Значение"), Элементы.ЗначенияПоказателейЗначение.Формат);
КонецПроцедуры

#КонецОбласти
