#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	ЕАС_ОбластиДанныхКопируемый.НазначитьОбластьДанных(ЭтотОбъект);
	
	ЕАС_ОбменВызовСервераКопируемый.ЗарегистрироватьИзмененияСправочника(ЭтотОбъект);
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
	ЕАС_ОбменВызовСервераКопируемый.ЗарегистрироватьИзмененияСправочника(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
