#Область ОписаниеПеременных

&НаКлиенте
Перем ШтатноеЗакрытие;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПолеТекст = Параметры.Текст;
	Заголовок = Параметры.Заголовок;
	
	Параметры.Свойство("ГиперссылкаТекст",     ГиперссылкаТекст);
	Параметры.Свойство("ГиперссылкаНавигация", ГиперссылкаНавигация);
	Параметры.Свойство("ГиперссылкаИмяФормы",  ГиперссылкаИмяФормы);
	Параметры.Свойство("ГиперссылкаПараметры", ГиперссылкаПараметры);
	
КонецПроцедуры


&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗавершениеРаботы Тогда
        Возврат;
    КонецЕсли; 
    
    Если ШтатноеЗакрытие = Неопределено Тогда
        ШтатноеЗакрытие = Истина;
        СтандартнаяОбработка = Ложь;
        Отказ = Истина;
        ПодключитьОбработчикОжидания("ШтатноеЗакрытиеФормы", 0.1, Истина);
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ГиперссылкаНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если НЕ ПустаяСтрока(ГиперссылкаНавигация) Тогда
		Попытка
			ПерейтиПоНавигационнойСсылке(ГиперссылкаНавигация);
		Исключение
			ПоказатьПредупреждение(, НСтр("ru = 'Переход по ссылке невозможен'"));
		КонецПопытки;
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(ГиперссылкаИмяФормы) Тогда
		Попытка
			ОткрытьФорму(ГиперссылкаИмяФормы, ГиперссылкаПараметры);
		Исключение
			ПоказатьПредупреждение(, НСтр("ru = 'Переход по ссылке невозможен'"));
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьПравки(Команда)
	ПолеТекст = Параметры.Текст;
КонецПроцедуры

#КонецОбласти            

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ШтатноеЗакрытиеФормы()
	Закрыть(ПолеТекст);
КонецПроцедуры

#КонецОбласти
